luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_regdef.h
/** \brief  New Data Register 3 */
typedef struct _Ifx_ERAY_NDAT3_Bits
{
    unsigned int ND64:1;                    /**< \brief [0:0] New Data 64 (64 = 64-95) (rh) */
    unsigned int ND65:1;                    /**< \brief [1:1] New Data 65 (65 = 64-95) (rh) */
    unsigned int ND66:1;                    /**< \brief [2:2] New Data 66 (66 = 64-95) (rh) */
    unsigned int ND67:1;                    /**< \brief [3:3] New Data 67 (67 = 64-95) (rh) */
    unsigned int ND68:1;                    /**< \brief [4:4] New Data 68 (68 = 64-95) (rh) */
    unsigned int ND69:1;                    /**< \brief [5:5] New Data 69 (69 = 64-95) (rh) */
    unsigned int ND70:1;                    /**< \brief [6:6] New Data 70 (70 = 64-95) (rh) */
    unsigned int ND71:1;                    /**< \brief [7:7] New Data 71 (71 = 64-95) (rh) */
    unsigned int ND72:1;                    /**< \brief [8:8] New Data 72 (72 = 64-95) (rh) */
    unsigned int ND73:1;                    /**< \brief [9:9] New Data 73 (73 = 64-95) (rh) */
    unsigned int ND74:1;                    /**< \brief [10:10] New Data 74 (74 = 64-95) (rh) */
    unsigned int ND75:1;                    /**< \brief [11:11] New Data 75 (75 = 64-95) (rh) */
    unsigned int ND76:1;                    /**< \brief [12:12] New Data 76 (76 = 64-95) (rh) */
    unsigned int ND77:1;                    /**< \brief [13:13] New Data 77 (77 = 64-95) (rh) */
    unsigned int ND78:1;                    /**< \brief [14:14] New Data 78 (78 = 64-95) (rh) */
    unsigned int ND79:1;                    /**< \brief [15:15] New Data 79 (79 = 64-95) (rh) */
    unsigned int ND80:1;                    /**< \brief [16:16] New Data 80 (80 = 64-95) (rh) */
    unsigned int ND81:1;                    /**< \brief [17:17] New Data 81 (81 = 64-95) (rh) */
    unsigned int ND82:1;                    /**< \brief [18:18] New Data 82 (82 = 64-95) (rh) */
    unsigned int ND83:1;                    /**< \brief [19:19] New Data 83 (83 = 64-95) (rh) */
    unsigned int ND84:1;                    /**< \brief [20:20] New Data 84 (84 = 64-95) (rh) */
    unsigned int ND85:1;                    /**< \brief [21:21] New Data 85 (85 = 64-95) (rh) */
    unsigned int ND86:1;                    /**< \brief [22:22] New Data 86 (86 = 64-95) (rh) */
    unsigned int ND87:1;                    /**< \brief [23:23] New Data 87 (87 = 64-95) (rh) */
    unsigned int ND88:1;                    /**< \brief [24:24] New Data 88 (88 = 64-95) (rh) */
    unsigned int ND89:1;                    /**< \brief [25:25] New Data 89 (89 = 64-95) (rh) */
    unsigned int ND90:1;                    /**< \brief [26:26] New Data 90 (90 = 64-95) (rh) */
    unsigned int ND91:1;                    /**< \brief [27:27] New Data 91 (91 = 64-95) (rh) */
    unsigned int ND92:1;                    /**< \brief [28:28] New Data 92 (92 = 64-95) (rh) */
    unsigned int ND93:1;                    /**< \brief [29:29] New Data 93 (93 = 64-95) (rh) */
    unsigned int ND94:1;                    /**< \brief [30:30] New Data 94 (94 = 64-95) (rh) */
    unsigned int ND95:1;                    /**< \brief [31:31] New Data 95 (95 = 64-95) (rh) */
} Ifx_ERAY_NDAT3_Bits;

/** \brief  New Data Register 4 */
typedef struct _Ifx_ERAY_NDAT4_Bits
{
    unsigned int ND96:1;                    /**< \brief [0:0] New Data 96 (96 = 96-127) (rh) */
    unsigned int ND97:1;                    /**< \brief [1:1] New Data 97 (97 = 96-127) (rh) */
    unsigned int ND98:1;                    /**< \brief [2:2] New Data 98 (98 = 96-127) (rh) */
    unsigned int ND99:1;                    /**< \brief [3:3] New Data 99 (99 = 96-127) (rh) */
    unsigned int ND100:1;                   /**< \brief [4:4] New Data 100 (100 = 96-127) (rh) */
    unsigned int ND101:1;                   /**< \brief [5:5] New Data 101 (101 = 96-127) (rh) */
    unsigned int ND102:1;                   /**< \brief [6:6] New Data 102 (102 = 96-127) (rh) */
    unsigned int ND103:1;                   /**< \brief [7:7] New Data 103 (103 = 96-127) (rh) */
    unsigned int ND104:1;                   /**< \brief [8:8] New Data 104 (104 = 96-127) (rh) */
    unsigned int ND105:1;                   /**< \brief [9:9] New Data 105 (105 = 96-127) (rh) */
    unsigned int ND106:1;                   /**< \brief [10:10] New Data 106 (106 = 96-127) (rh) */
    unsigned int ND107:1;                   /**< \brief [11:11] New Data 107 (107 = 96-127) (rh) */
    unsigned int ND108:1;                   /**< \brief [12:12] New Data 108 (108 = 96-127) (rh) */
    unsigned int ND109:1;                   /**< \brief [13:13] New Data 109 (109 = 96-127) (rh) */
    unsigned int ND110:1;                   /**< \brief [14:14] New Data 110 (110 = 96-127) (rh) */
    unsigned int ND111:1;                   /**< \brief [15:15] New Data 111 (111 = 96-127) (rh) */
    unsigned int ND112:1;                   /**< \brief [16:16] New Data 112 (112 = 96-127) (rh) */
    unsigned int ND113:1;                   /**< \brief [17:17] New Data 113 (113 = 96-127) (rh) */
    unsigned int ND114:1;                   /**< \brief [18:18] New Data 114 (114 = 96-127) (rh) */
    unsigned int ND115:1;                   /**< \brief [19:19] New Data 115 (115 = 96-127) (rh) */
    unsigned int ND116:1;                   /**< \brief [20:20] New Data 116 (116 = 96-127) (rh) */
    unsigned int ND117:1;                   /**< \brief [21:21] New Data 117 (117 = 96-127) (rh) */
    unsigned int ND118:1;                   /**< \brief [22:22] New Data 118 (118 = 96-127) (rh) */
    unsigned int ND119:1;                   /**< \brief [23:23] New Data 119 (119 = 96-127) (rh) */
    unsigned int ND120:1;                   /**< \brief [24:24] New Data 120 (120 = 96-127) (rh) */
    unsigned int ND121:1;                   /**< \brief [25:25] New Data 121 (121 = 96-127) (rh) */
    unsigned int ND122:1;                   /**< \brief [26:26] New Data 122 (122 = 96-127) (rh) */
    unsigned int ND123:1;                   /**< \brief [27:27] New Data 123 (123 = 96-127) (rh) */
    unsigned int ND124:1;                   /**< \brief [28:28] New Data 124 (124 = 96-127) (rh) */
    unsigned int ND125:1;                   /**< \brief [29:29] New Data 125 (125 = 96-127) (rh) */
    unsigned int ND126:1;                   /**< \brief [30:30] New Data 126 (126 = 96-127) (rh) */
    unsigned int ND127:1;                   /**< \brief [31:31] New Data 127 (127 = 96-127) (rh) */
} Ifx_ERAY_NDAT4_Bits;

