luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_regdef.h
/** \brief  Read Header Section 1 */
typedef struct _Ifx_ERAY_RDHS1_Bits
{
    unsigned int FID:11;                    /**< \brief [10:0] Frame ID (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int CYC:7;                     /**< \brief [22:16] Cycle Code (rh) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int CHA:1;                     /**< \brief [24:24] Channel Filter Control A (rh) */
    unsigned int CHB:1;                     /**< \brief [25:25] Channel Filter Control B (rh) */
    unsigned int CFG:1;                     /**< \brief [26:26] Message Buffer Direction Configuration Bit (rh) */
    unsigned int PPIT:1;                    /**< \brief [27:27] Payload Preamble Indicator Transmit (rh) */
    unsigned int TXM:1;                     /**< \brief [28:28] Transmission Mode (rh) */
    unsigned int MBI:1;                     /**< \brief [29:29] Message Buffer Service Request (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_RDHS1_Bits;

/** \brief  Read Header Section 2 */
typedef struct _Ifx_ERAY_RDHS2_Bits
{
    unsigned int CRC:11;                    /**< \brief [10:0] Header CRC (vRF!Header!HeaderCRC) (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int PLC:7;                     /**< \brief [22:16] Payload Length Configured (rh) */
    unsigned int reserved_23:1;             /**< \brief \internal Reserved */
    unsigned int PLR:7;                     /**< \brief [30:24] Payload Length Received (vRF!Header!Length) (rh) */
    unsigned int reserved_31:1;             /**< \brief \internal Reserved */
} Ifx_ERAY_RDHS2_Bits;

/** \brief  Read Header Section 3 */
typedef struct _Ifx_ERAY_RDHS3_Bits
{
    unsigned int DP:11;                     /**< \brief [10:0] Data Pointer (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int RCC:6;                     /**< \brief [21:16] Receive Cycle Count (vRF!Header!CycleCount) (rh) */
    unsigned int reserved_22:2;             /**< \brief \internal Reserved */
    unsigned int RCI:1;                     /**< \brief [24:24] Received on Channel Indicator (vSS!Channel) (rh) */
    unsigned int SFI:1;                     /**< \brief [25:25] Startup Frame Indicator (vRF!Header!SuFIndicator) (rh) */
    unsigned int SYN:1;                     /**< \brief [26:26] SYNC Frame Indicator (vRF!Header!SyFIndicator) (rh) */
    unsigned int NFI:1;                     /**< \brief [27:27] NULL Frame Indicator (vRF!Header!NFIndicator) (rh) */
    unsigned int PPI:1;                     /**< \brief [28:28] Payload Preamble Indicator (vRF!Header!PPIndicator) (rh) */
    unsigned int RES:1;                     /**< \brief [29:29] Reserved Bit (vRF!Header!Reserved) (rh) */
    unsigned int reserved_30:2;             /**< \brief \internal Reserved */
} Ifx_ERAY_RDHS3_Bits;

/** \brief  Slot Counter Value */
typedef struct _Ifx_ERAY_SCV_Bits
{
    unsigned int SCCA:11;                   /**< \brief [10:0] Slot Counter Channel A (vSlotCounter[A]) (rh) */
    unsigned int reserved_11:5;             /**< \brief \internal Reserved */
    unsigned int SCCB:11;                   /**< \brief [26:16] Slot Counter Channel B (vSlotCounter[B]) (rh) */
    unsigned int reserved_27:5;             /**< \brief \internal Reserved */
} Ifx_ERAY_SCV_Bits;

/** \brief  SYNC Frame Status */
typedef struct _Ifx_ERAY_SFS_Bits
{
    unsigned int VSAE:4;                    /**< \brief [3:0] Valid SYNC Frames Channel A, even communication cycle (rh) */
    unsigned int VSAO:4;                    /**< \brief [7:4] Valid SYNC Frames Channel A, odd communication cycle (rh) */
    unsigned int VSBE:4;                    /**< \brief [11:8] Valid SYNC Frames Channel B, even communication cycle (rh) */
    unsigned int VSBO:4;                    /**< \brief [15:12] Valid SYNC Frames Channel B, odd communication cycle (rh) */
    unsigned int MOCS:1;                    /**< \brief [16:16] Missing Offset Correction Signal (rh) */
    unsigned int OCLR:1;                    /**< \brief [17:17] Offset Correction Limit Reached (rh) */
    unsigned int MRCS:1;                    /**< \brief [18:18] Missing Rate Correction Signal (rh) */
    unsigned int RCLR:1;                    /**< \brief [19:19] Rate Correction Limit Reached (rh) */
    unsigned int reserved_20:12;            /**< \brief \internal Reserved */
} Ifx_ERAY_SFS_Bits;

/** \brief  Status Service Request Enable Reset */
typedef struct _Ifx_ERAY_SIER_Bits
{
    unsigned int WSTE:1;                    /**< \brief [0:0] Wakeup Status Service Request Enable (rwh) */
    unsigned int CASE:1;                    /**< \brief [1:1] Collision Avoidance Symbol Service Request Enable (rwh) */
    unsigned int CYCSE:1;                   /**< \brief [2:2] Cycle Start Service Request Enable (rwh) */
    unsigned int TXIE:1;                    /**< \brief [3:3] Transmit Service Request Enable (rwh) */
    unsigned int RXIE:1;                    /**< \brief [4:4] Receive Service Request Enable (rwh) */
    unsigned int RFNEE:1;                   /**< \brief [5:5] Receive FIFO Not Empty Service Request Enable (rwh) */
    unsigned int RFCLE:1;                   /**< \brief [6:6] Receive FIFO Critical Level Service Request Enable (rwh) */
    unsigned int NMVCE:1;                   /**< \brief [7:7] Network Management Vector Changed Service Request Enable (rwh) */
    unsigned int TI0E:1;                    /**< \brief [8:8] Timer Service Request 0 Enable (rwh) */
    unsigned int TI1E:1;                    /**< \brief [9:9] Timer Service Request 1 Enable (rwh) */
    unsigned int TIBCE:1;                   /**< \brief [10:10] Transfer Input Buffer Completed Service Request Enable (rwh) */
    unsigned int TOBCE:1;                   /**< \brief [11:11] Transfer Output Buffer Completed Service Request Enable (rwh) */
    unsigned int SWEE:1;                    /**< \brief [12:12] Stop Watch Event Service Request Enable (rwh) */
    unsigned int SUCSE:1;                   /**< \brief [13:13] Startup Completed Successfully Service Request Enable (rwh) */
    unsigned int MBSIE:1;                   /**< \brief [14:14] Message Buffer Status Service Request Enable (rwh) */
    unsigned int SDSE:1;                    /**< \brief [15:15] Start of Dynamic Segment Service Request Enable (rwh) */
    unsigned int WUPAE:1;                   /**< \brief [16:16] Wakeup Pattern Channel A Service Request Enable (rwh) */
    unsigned int MTSAE:1;                   /**< \brief [17:17] Media Access Test Symbol Channel A Service Request Enable (rwh) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int WUPBE:1;                   /**< \brief [24:24] Wakeup Pattern Channel B Service Request Enable (rwh) */
    unsigned int MTSBE:1;                   /**< \brief [25:25] Media Access Test Symbol Channel B Service Request Enable (rwh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ERAY_SIER_Bits;

/** \brief  Status Service Request Enable Set */
typedef struct _Ifx_ERAY_SIES_Bits
{
    unsigned int WSTE:1;                    /**< \brief [0:0] Wakeup Status Service Request Enable (rwh) */
    unsigned int CASE:1;                    /**< \brief [1:1] Collision Avoidance Symbol Service Request Enable (rwh) */
    unsigned int CYCSE:1;                   /**< \brief [2:2] Cycle Start Service Request Enable (rwh) */
    unsigned int TXIE:1;                    /**< \brief [3:3] Transmit Service Request Enable (rwh) */
    unsigned int RXIE:1;                    /**< \brief [4:4] Receive Service Request Enable (rwh) */
    unsigned int RFNEE:1;                   /**< \brief [5:5] Receive FIFO Not Empty Service Request Enable (rwh) */
    unsigned int RFCLE:1;                   /**< \brief [6:6] Receive FIFO Critical Level Service Request Enable (rwh) */
    unsigned int NMVCE:1;                   /**< \brief [7:7] Network Management Vector Changed Service Request Enable (rwh) */
    unsigned int TI0E:1;                    /**< \brief [8:8] Timer Service Request 0 Enable (rwh) */
    unsigned int TI1E:1;                    /**< \brief [9:9] Timer Service Request 1 Enable (rwh) */
    unsigned int TIBCE:1;                   /**< \brief [10:10] Transfer Input Buffer Completed Service Request Enable (rwh) */
    unsigned int TOBCE:1;                   /**< \brief [11:11] Transfer Output Buffer Completed Service Request Enable (rwh) */
    unsigned int SWEE:1;                    /**< \brief [12:12] Stop Watch Event Service Request Enable (rwh) */
    unsigned int SUCSE:1;                   /**< \brief [13:13] Startup Completed Successfully Service Request Enable (rwh) */
    unsigned int MBSIE:1;                   /**< \brief [14:14] Message Buffer Status Service Request Enable (rwh) */
    unsigned int SDSE:1;                    /**< \brief [15:15] Start of Dynamic Segment Service Request Enable (rwh) */
    unsigned int WUPAE:1;                   /**< \brief [16:16] Wakeup Pattern Channel A Service Request Enable (rwh) */
    unsigned int MTSAE:1;                   /**< \brief [17:17] Media Access Test Symbol Channel A Service Request Enable (rwh) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int WUPBE:1;                   /**< \brief [24:24] Wakeup Pattern Channel B Service Request Enable (rwh) */
    unsigned int MTSBE:1;                   /**< \brief [25:25] Media Access Test Symbol Channel B Service Request Enable (rwh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ERAY_SIES_Bits;

/** \brief  Status Service Request Line Select */
typedef struct _Ifx_ERAY_SILS_Bits
{
    unsigned int WSTL:1;                    /**< \brief [0:0] Wakeup Status Service Request Line (rw) */
    unsigned int CASL:1;                    /**< \brief [1:1] Collision Avoidance Symbol Service Request Line (rw) */
    unsigned int CYCSL:1;                   /**< \brief [2:2] Cycle Start Service Request Line (rw) */
    unsigned int TXIL:1;                    /**< \brief [3:3] Transmit Service Request Line (rw) */
    unsigned int RXIL:1;                    /**< \brief [4:4] Receive Service Request Line (rw) */
    unsigned int RFNEL:1;                   /**< \brief [5:5] Receive FIFO Not Empty Service Request Line (rw) */
    unsigned int RFCLL:1;                   /**< \brief [6:6] Receive FIFO Critical Level Service Request Line (rw) */
    unsigned int NMVCL:1;                   /**< \brief [7:7] Network Management Vector Changed Service Request Line (rw) */
    unsigned int TI0L:1;                    /**< \brief [8:8] Timer Service Request 0 Line (rw) */
    unsigned int TI1L:1;                    /**< \brief [9:9] Timer Service Request 1 Line (rw) */
    unsigned int TIBCL:1;                   /**< \brief [10:10] Transfer Input Buffer Completed Service Request Line (rw) */
    unsigned int TOBCL:1;                   /**< \brief [11:11] Transfer Output Buffer Completed Service Request Line (rw) */
    unsigned int SWEL:1;                    /**< \brief [12:12] Stop Watch Event Service Request Line (rw) */
    unsigned int SUCSL:1;                   /**< \brief [13:13] Startup Completed Successfully Service Request Line (rw) */
    unsigned int MBSIL:1;                   /**< \brief [14:14] Message Buffer Status Service Request Line (rw) */
    unsigned int SDSL:1;                    /**< \brief [15:15] Start of Dynamic Segment Service Request Line (rw) */
    unsigned int WUPAL:1;                   /**< \brief [16:16] Wakeup Pattern Channel A Service Request Line (rw) */
    unsigned int MTSAL:1;                   /**< \brief [17:17] Media Access Test Symbol Channel A Service Request Line (rw) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int WUPBL:1;                   /**< \brief [24:24] Wakeup Pattern Channel B Service Request Line (rw) */
    unsigned int MTSBL:1;                   /**< \brief [25:25] Media Access Test Symbol Channel B Service Request Line (rw) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ERAY_SILS_Bits;

/** \brief  Status Service Request Register */
typedef struct _Ifx_ERAY_SIR_Bits
{
    unsigned int WST:1;                     /**< \brief [0:0] Wakeup Status (rwh) */
    unsigned int CAS:1;                     /**< \brief [1:1] Collision Avoidance Symbol (rwh) */
    unsigned int CYCS:1;                    /**< \brief [2:2] Cycle Start Service Request (rwh) */
    unsigned int TXI:1;                     /**< \brief [3:3] Transmit Service Request (rwh) */
    unsigned int RXI:1;                     /**< \brief [4:4] Receive Service Request (rwh) */
    unsigned int RFNE:1;                    /**< \brief [5:5] Receive FIFO Not Empty (rh) */
    unsigned int RFCL:1;                    /**< \brief [6:6] Receive FIFO Critical Level (rh) */
    unsigned int NMVC:1;                    /**< \brief [7:7] Network Management Vector Changed (rwh) */
    unsigned int TI0:1;                     /**< \brief [8:8] Timer Service Request 0 (rwh) */
    unsigned int TI1:1;                     /**< \brief [9:9] Timer Service Request 1 (rwh) */
    unsigned int TIBC:1;                    /**< \brief [10:10] Transfer Input Buffer Completed (rwh) */
    unsigned int TOBC:1;                    /**< \brief [11:11] Transfer Output Buffer Completed (rwh) */
    unsigned int SWE:1;                     /**< \brief [12:12] Stop Watch Event (rwh) */
    unsigned int SUCS:1;                    /**< \brief [13:13] Startup Completed Successfully (rwh) */
    unsigned int MBSI:1;                    /**< \brief [14:14] Message Buffer Status Service Request (rwh) */
    unsigned int SDS:1;                     /**< \brief [15:15] Start of Dynamic Segment (rwh) */
    unsigned int WUPA:1;                    /**< \brief [16:16] Wakeup Pattern Channel A (rwh) */
    unsigned int MTSA:1;                    /**< \brief [17:17] MTS Received on Channel A (vSS!ValidMTSA) (rwh) */
    unsigned int reserved_18:6;             /**< \brief \internal Reserved */
    unsigned int WUPB:1;                    /**< \brief [24:24] Wakeup Pattern Channel B (rwh) */
    unsigned int MTSB:1;                    /**< \brief [25:25] MTS Received on Channel B (vSS!ValidMTSB) (rwh) */
    unsigned int reserved_26:6;             /**< \brief \internal Reserved */
} Ifx_ERAY_SIR_Bits;

