luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_regdef.h
/** \brief  Write Header Section 3 */
typedef struct _Ifx_ERAY_WRHS3_Bits
{
    unsigned int DP:11;                     /**< \brief [10:0] Data Pointer (rw) */
    unsigned int reserved_11:21;            /**< \brief \internal Reserved */
} Ifx_ERAY_WRHS3_Bits;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Eray_union
 * \{  */

/** \brief  Access Enable Register 0 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_ACCEN0_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_ACCEN0;

/** \brief  Access Enable Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_ACCEN1_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_ACCEN1;

/** \brief  Aggregated Channel Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_ACS_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_ACS;

/** \brief  Communication Controller Error Vector */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_CCEV_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_CCEV;

/** \brief  Communication Controller Status Vector */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_CCSV_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_CCSV;

/** \brief  Clock Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_CLC_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_CLC;

/** \brief  Core Release Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_CREL_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_CREL;

/** \brief  Busy and Input Buffer Control Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_CUST1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_CUST1;

/** \brief  Customer Interface Timeout Counter */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_CUST3_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_CUST3;

/** \brief  Error Service Request Enable Reset */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_EIER_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_EIER;

/** \brief  Error Service Request Enable Set */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_EIES_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_EIES;

/** \brief  Error Service Request Line Select */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_EILS_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_EILS;

/** \brief  Error Service Request Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_EIR_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_EIR;

/** \brief  Endian Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_ENDN_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_ENDN;

/** \brief  Even Sync ID Symbol Window */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_ESID_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_ESID;

/** \brief  FIFO Critical Level */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_FCL_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_FCL;

/** \brief  FIFO Rejection Filter */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_FRF_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_FRF;

/** \brief  FIFO Rejection Filter Mask */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_FRFM_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_FRFM;

/** \brief  FIFO Status Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_FSR_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_FSR;

/** \brief  GTU Configuration Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC01_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC01;

/** \brief  GTU Configuration Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_GTUC02_Bits B;                 /**< \brief Bitfield access */
} Ifx_ERAY_GTUC02;

