luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_regdef.h
/** \brief  Message Buffer Status Changed 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MBSC2_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_MBSC2;

/** \brief  Message Buffer Status Changed 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MBSC3_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_MBSC3;

/** \brief  Message Buffer Status Changed 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MBSC4_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_MBSC4;

/** \brief  MHD Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MHDC_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_MHDC;

/** \brief  Message Handler Constraints Flags */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MHDF_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_MHDF;

/** \brief  Message Handler Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MHDS_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_MHDS;

/** \brief  Message RAM Configuration */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MRC_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_MRC;

/** \brief  Message Buffer Status Changed Interrupt Control 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MSIC1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_MSIC1;

/** \brief  Message Buffer Status Changed Interrupt Control 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MSIC2_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_MSIC2;

/** \brief  Message Buffer Status Changed Interrupt Control 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MSIC3_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_MSIC3;

/** \brief  Message Buffer Status Changed Interrupt Control 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MSIC4_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_MSIC4;

/** \brief  Macrotick and Cycle Counter Value */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_MTCCV_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_MTCCV;

/** \brief  New Data Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_NDAT1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_NDAT1;

/** \brief  New Data Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_NDAT2_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_NDAT2;

/** \brief  New Data Register 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_NDAT3_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_NDAT3;

/** \brief  New Data Register 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_NDAT4_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_NDAT4;

/** \brief  New Data Interrupt Control 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_NDIC1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_NDIC1;

/** \brief  New Data Interrupt Control 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_NDIC2_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_NDIC2;

/** \brief  New Data Interrupt Control 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_NDIC3_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_NDIC3;

/** \brief  New Data Interrupt Control 4 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_NDIC4_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_NDIC4;

/** \brief  NEM Configuration Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_NEMC_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_NEMC;

