luvea/TC277_RobotCtrl_Fan/Aurix_MC-ISAR/general/tricore/inc/TC27xC/IfxEray_regdef.h
/** \brief  Network Management Vector */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_NMV_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_NMV;

/** \brief  Output Buffer Command Mask */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_OBCM_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_OBCM;

/** \brief  Output Buffer Command Request */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_OBCR_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_OBCR;

/** \brief  OCDS Control and Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_OCS_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_OCS;

/** \brief  Offset Correction Value */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_OCV_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_OCV;

/** \brief  Odd Sync ID Symbol Window */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_OSID_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_OSID;

/** \brief  OCDS Trigger Set Select */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_OTSS_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_OTSS;

/** \brief  PRT Configuration Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_PRTC1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_PRTC1;

/** \brief  PRT Configuration Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_PRTC2_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_PRTC2;

/** \brief  Rate Correction Value */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_RCV_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_RCV;

/** \brief  Read Data Section */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_RDDS_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_RDDS;

/** \brief  Read Header Section 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_RDHS1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_RDHS1;

/** \brief  Read Header Section 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_RDHS2_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_RDHS2;

/** \brief  Read Header Section 3 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_RDHS3_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_RDHS3;

/** \brief  Slot Counter Value */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_SCV_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_SCV;

/** \brief  SYNC Frame Status */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_SFS_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_SFS;

/** \brief  Status Service Request Enable Reset */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_SIER_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_SIER;

/** \brief  Status Service Request Enable Set */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_SIES_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_SIES;

/** \brief  Status Service Request Line Select */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_SILS_Bits B;                   /**< \brief Bitfield access */
} Ifx_ERAY_SILS;

/** \brief  Status Service Request Register */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_SIR_Bits B;                    /**< \brief Bitfield access */
} Ifx_ERAY_SIR;

/** \brief  Stop Watch Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_STPW1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_STPW1;

/** \brief  Stop Watch Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_STPW2_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_STPW2;

/** \brief  SUC Configuration Register 1 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_SUCC1_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_SUCC1;

/** \brief  SUC Configuration Register 2 */
typedef union
{
    unsigned int U;                         /**< \brief Unsigned access */
    signed int I;                           /**< \brief Signed access */
    Ifx_ERAY_SUCC2_Bits B;                  /**< \brief Bitfield access */
} Ifx_ERAY_SUCC2;

